// Напишите программу, которая принимает на вход пятизначное число 
// и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

// Console.Write("Введите пятизначное число:");
// int x = Convert.ToInt32(Console.ReadLine());
// int a1 = x / 10000;
// int b1 = x % 10; 
// int a2 = x / 1000 % 10;
// int b2 = x /10 % 10;

// if (a1 == b1 && a2 == b2)
// {
//     Console.Write(x +" -> " + "Число является палиндромом" );
// }
// else
// {
//     Console.Write(x +" -> " + "Число не является палиндромом" );
    
// }

// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125

// Console.Write("Введите число:");
// int num = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Таблица кубов от 1 до числа " + num + ":");
// for (int i = 1; i <= num; i++)
// {
//     Console.WriteLine(i + " ^ 3" + " = " + i * i * i);
// }
 

//  Напишите программу, которая принимает на вход координаты двух точек 
// и находит расстояние между ними в 3D пространстве.
// A(3,6,8); B(2,1,-7), -> 15.84
// A(7,-5, 0); B(1,-1,9) -> 11.53
